{
	"Andhra Pradesh": {
		"1": {
			"Ans": "Veerabhadra temple",
			"Story": "The Veerabhadra temple of Lepakshi, which was built by the brothers Viranna and Virupanna, is dedicated to Veerabhadra. It is an example of the Vijayanagara architectural style. Points of interest in the temple include a rock chain, Vastu Purusha, the Padmini race lady, the hanging pillar, Durga Paadam, the eyes of Virupaksha and Lepakshi saree designs. The paintings on the roof which feature a mural of Veerabhadra are made with natural pigments. Another interesting aspect of this temple is that it is North facing. There is a 3 headed bull with single body is carved on the pillar of main entrance."
		},
		"2": {
			"Ans": "Bojjana Konda",
			"Story": "Sankaram, a small village, is situated about a mile to the east of Anakapalli in the Visakhapatnam district of Andhra Pradesh. A short distance to the north of the village are two hills, the one on the east called Bojjannakonda and the other on the west called Lingalakonda, both of which are surrounded by paddy fields. The hills contain numerous monolithic stupas, rock-cut caves, chaityas and monasteries forming one of the most remarkable Buddhist establishments in Andhra Pradesh during the period from the 4th to the 9th Century CE. The name of the village Sankaram is evidently a corruption of Sangharam (Boudha-arama, i.e., vihara) as these Buddhist establishments are generally known."
		},
		"3": {
			"Ans": "Padmavati temple",
			"Story": "t is believed that the Goddess Lakshmi was born as Alamelu to Akasha Raja, the ruler of this region, and wed Venkateshwara of Tirupati. Goddess Lakshmi gave darshan to Lord Venkateswara on a red Lotus flower (Padma in Sanskrit) at Alamelu mangapuram after his deep penance for twelve years. According to tradition, the Mother Goddess manifested Herself in the holy Pushkarini called Padmasarovaram in a golden lotus. The Venkatachala Mahatyam states that Lord Suryanarayana was instrumental in blossoming of the lotus in full splendour. A temple dedicated to Lord Suryanarayana is situated on the eastern side of the Pushkarini. The Padma Purana gives a vivid description of the advent of the Goddess and subsequent wedding with Lord Srinivasa. The manifestation of Sri Padmavathi Devi occurred in the month of Karthika on Sukla Paksha Panchami when the star Uttarashada in the ascendent. The Brahmotsavam of the Goddess is celebrated with all pomp and glory to commemorate the auspicious occasion of Her avatara."
		},
		"4": {
			"Ans": "Amravati Stupa",
			"Story": "Amaravati Stupa was regarded to be a very important seat of Buddhism and it attracted pilgrims from distant places. Its Great Stupa was famous as it contained the relics of Buddha. It was surrounded by a sculptured rail about 13 feet high. The Great Stupa rose to a height of about 100 feet. The rail was formed of upright slabs or pillars about 10 feet high. The inside of the rail was richly carved.the rail was probably the most elaborate and artistic monument of the kind in India. The Stupa measured about 435 feet in circumference at the base."
		}
	},
	"Arunachal Pradesh": {
		"1": {
			"Ans": "Bhismak Nagar",
			"Story": "Traditionally, the rulers of the Chutia dynasty trace thier ancestry with 'Bhismaka', the legendary king of Bhismaknagar. Structural remains are comprised of group of brick built structures enclosed by a fortified rampat wall.It is said to be the capital of the Chutia dynasty."
		},
		"2": {
			"Ans": "Bhalakpong Fort",
			"Story": "It is the legendary capital of king Bhalukpa, the grandson of Bana who is believed to be the contemporary of legendary king Naraka of Pragjyotishpur. Ruins of Fort, brick structures and remnants of ring wells can be seen here. The fort can be assiciated with the mighty Salasthambhas who ruled the area from the middle of the seventh century. Later, it was ruled by the Palas of Assam during tenth to twelve century CE."
		},
		"3": {
			"Ans": "Ita Fort",
			"Story": "The capital city of Arunachal Pradesh, Itanagar has derived its name from the famous Ita Fort. The Ita fort of Itanagar is of ample historical importance and is located at the heart of the capital city in Papum Pare district of Itanagar. . The Research Department of the Government of Arunachal Pradesh has surveyed, explored and later on excavated the remains of the fort. This historical monument the Ita Fort of Itanagar, Arunachal Pradesh was established by the rulers of the Ahom dynasty, somewhere between 14th and 15th century. The excavated ruins of this historical fort are one of the major tourist attractions in Itanagar and being imposing it was highly irregular in shape."
		},
		"4": {
			"Ans": "Tawang War Memorial",
			"Story": "Tawang war memorial is in the northeastern state of Arunachal Pradesh. The war memorial is a Buddhist shrine build to honor the Indian martyrs who sacrificed their lives during the Indo – China war in the year of 1The Tawang war memorial is a 40-foot high multi-hued memorial. The Tawang war memorial is located 1 kilometer away from the Tawang town."
		}
	},
	"Assam": {
		"1": {
			"Ans": "Kamakhya Temple",
			"Story": "Kamakhya Temple is a Hindu temple dedicated to the mighty goddess Kamakhya and is nestled at the top of the Nilachal Hill by the river Brahmaputra. This is one of the most important pilgrimage destination in the city of Guwahati. The temple is nearly 6 kms from the Guwahati railway junction."
		},
		"2": {
			"Ans": "Charideo",
			"Story": "Charaideo is one of the most visited place in Sivasagar district of Assam. The place has excellent historic importance and its tombs are often compared with the Pyramids of Egypt. Charaideo was the first capital of Ahom Kings and contains sacred burial ground of Ahom kings and queens."
		},
		"3": {
			"Ans": "Agnigarh",
			"Story": "Agnigarh is one of the most beautiful monument in the Tezpur and is located on a hilltop by the bank of mighty Brahmaputra. This historic palace is well known for its excellent historic important and mind blowing architecture, which surrounded by rampart of fire."
		},
		"4": {
			"Ans": "Shivadol",
			"Story": "An antique piece of Ahom Architecture, nestled on the heart of Sivasagar city. This temple is dedicated to the mighty Lord Shiva. This temple have a golden vase on its top and make it an important place of tourist attraction."
		}
	},
	"Bihar": {
		"1": {
			"Ans": "Tomb of Sher Shah Suri",
			"Story": "The Tomb of Sher Shah Suri located in Sasaram, Bihar is an example of Indo- Islamic architecture. The tomb is regarded as one of the noblest specimens of Afghan architecture in India. It is an imposing brick structure partly veneered with stone standing in the middle of a fine square tank. The tomb of his father Hassan Shah and that of his son Salim Shah are some other architectural monuments as well as archaeological interest at Sasaram worth visiting. "
		},
		"2": {
			"Ans": "Caves at Barabar hills",
			"Story": "These caves are oldest surviving rock-cut caves in India. These caves are situated in the twin hills of Barabar and Nagarjuni hills. These caves were created at Barabar Hills during Maurya period of 323 BC - 185 BC and is dedicated to Ajivaka Cult. The caves were used extensively by monks belonging to the Ajivika sect. The best time for travellers visiting the caves are from October to March. Travellers need to carry food and water while visiting the caves."
		},
		"3": {
			"Ans": "Rohtasgarh Fort",
			"Story": "This Fort is one of the most ancient forts of India located in a small town of Rohtas in Bihar. The fort is perched on a high hilltop and one has to climb about 2,000 odd steps to reach to the top of the fort. Other places of interest near the fort for travellers to visit are The Ganesh Temple, The Rohtasan Temple, The Aina Mahal and Habsh Khan's mausoleum."
		},
		"4": {
			"Ans": "Vikramshila University",
			"Story": "The ruins of Vikramshila University is located at about 50 km from Bhagalpur in Bihar and was one of the important and largest Buddhist universities in India. The site is now famous for Vikramshila Mahotsav, a cultural activity held annually during the month of February. There has been inflow of western tourist as well because of the Mahotsav."
		}
	},
	"Chhattisgarh": {
		"1": {
			"Ans": "Bhoramdeo Temple",
			"Story": "Bhoramdeo a thousand year old temple situated in Chouragaon is 18 km from Kawardha in Kabirdham district of Chhattisgarh and 125 Km from Raipur . this temple is dedicated to Lord Shiva. The temple is artificially situated between the mountain ranges, it was built during the period from 7th to 11th century. There is a glimpse of the Khajuraho temple in the temple here, hence this temple is also called “Khajuraho of Chhattisgarh”."
		},
		"2": {
			"Ans": "Jod Gumbaz",
			"Story": "This is also known as Abdul Razaq darga built in the year 1687 with a pair of tombs housed in this. The tombs have been in substantial elevation since the graves are built at the floor level with galleries within the domes. It was at the initiation of Afzal khan that the splendid tomb was constructed in his lifetime though his mortal remains was buried in another tomb. In Jod Gumbaz which is one km away from Afzal khan’s tomb is the tomb of his wives in 11 rows on the masonry platform."
		},
		"3": {
			"Ans": "Saat Manzil",
			"Story": "The ancient monuments of Adil Shahi era found in the city here, predominantly has carvings on the roof or wall in wood, ceramic, gold or mosaic, but two explorers have recently discovered that leather could have been used in roofing of monuments.This discovery has stunned French architect Klaus Rotzer and his explorer friend Amin Hullur, who noticed this during their routine work of collecting architectural details of Saat Manzil built during the Adil Shahi dynasty."
		},
		"4": {
			"Ans": "Bastar Palace",
			"Story": "Dating back to prehistoric times, the Bastar palace used to be the chief administrative building of the Bastar district. Constructed by the kings of Bastar, this palace is a famous tourist destination today. Home to some of the most beautiful figurines, etchings and drawings on the ceilings and walls, tourists are known to be transported back to prehistoric times when kings lived here, administrating the entire district. With wide corridors and a beautiful garden in the front, the palace makes for a perfect day trip from Jagdalpur. There are many artefacts like ornaments, weapons and clothes turning the palace into a kind of museum for visitors to gain more in-depth knowledge. Make the saying ‘Live like a king’ come true by visiting here for a day and live like a king."
		}
	},
	"Delhi": {
		"1": {
			"Ans": "Purana Qila",
			"Story": "One of the famous Historical Monument in Delhi also known as Purana Quila it showcase the excellence of Mughal military architecture . Purana Quila is different from the later forts of the Mughals as it have been rebuilt since the times of Pandavas than by Humayun and last by Sher Shah Suri. The Qal’a-I-Kunha Masjid and the Sher are the two prominent buildings inside the fort."
		},
		"2": {
			"Ans": "Humayun’s Tomb",
			"Story": "Humayun’s Tomb is popular Historical monuments in Delhi built by Humayun wife Hamida Banu Begam, also known as Haji Begam. It was built in 1569 after fourteen years of Humayun Death. The tomb complex also comprises of a Persian-style garden Char Bagh Garden built in quadrilateral layout .Some other monuments inside the complex are Tomb and mosque of Isa Khan , Bu Halima’s Tomb and Garden, Afsarwala Tomb and mosque, Arab Sarai, Nila Gumbad and many others. Humayun’s Tomb is also inlist in the UNESCO World Heritage Site."
		},
		"3": {
			"Ans": "Jama Masjid",
			"Story": "Jama Masjid is famous Historical Monuments in Delhi built by Shah Jahan – A Mughal emperor between 1644 and 1656. It was constructed by more than 5000 workers. It is also known as Masjid-i-Jahan Numa is one of the largest and most famous mosque of India. About 25,000 people can pray here at a time. Shah Jahan have built various majestic other Mosques in Agra, Ajmer and Lahore."
		},
		"4": {
			"Ans": "Jantar Mantar",
			"Story": "Jantar Mantar is a popular monument in DelhiBuilt by Maharaja Jai Singh II Jantar Mantar is comprises of 13 architectural astronomy instruments. The observatory was built in order to compile astronomical tables, and to predict the times and movements of the sun, moon and planets.There are three instruments within the Jantar Mantar are Samrat Yantra, the Jayaprakash, and the Misra Yantra."
		}
	},
	"Goa": {
		"1": {
			"Ans": "Rivona Caves",
			"Story": "The Rivona Caves also known as the Pandava caves are situated in the village of Rivona in South Goa. The Rivona caves are one of the few examples of Buddhist influence visible in Goa today. You will have a unique experience of Goa while you visit Rivona caves."
		},
		"2": {
			"Ans": "Basilica of Bom Jesus Church",
			"Story": "The church Basilica of Bom Jesus is one of the most prosperous churches in Goa. Daily, hundreds of pilgrims arrive at the church to pray to St Francis Xavier, whose tomb and mortal remains resides in the church. The church has been built in superb style by Giovanni Battista Foggini. The interiors have been finely decorated. It is a very famous church in Goa and is a prime tourists spot in Goa state."
		},
		"3": {
			"Ans": "Palace of Yusuf Adil Shah",
			"Story": "Gateway of the Palace of Yusuf Adil Shah is a famous monument located close to the Mandovi harbors in Goa. The Yusuf Adil Shah, the Sultan of Bijapur had constructed it. The palace was constructed in a blend of the Hindu-Muslim architectural style."
		},
		"4": {
			"Ans": "Se Cathedral",
			"Story": "Se cathedral is one of the largest churches in Asia located in Goa. It is one of the oldest and most famous religious buildings in Goa. The Se Cathedral is a massive church in Old Goa, devoted to Catherine of Alexandria. The architecture style of Se Cathedral is Portuguese-Manueline."
		}
	},
	"Gujarat": {
		"1": {
			"Ans": "Adalaj Stepwell",
			"Story": "of this well is the Indo-Islamic architecture. The walls of this well are beautifully carved with scenes One of the famous monuments in Ahmedabad located in the village of Adalaj, it was built in the year 1499 by Queen Rudabai. The main attraction of women shaking buttermilk, kings, dancers, and musicians, besides other fantastic scenes. Another main feature of this stepwell is the three entrance stairs out of many step wells in Gujarat."
		},
		"2": {
			"Ans": "Dada Hari Ni Vav",
			"Story": "Dada Hari Ni Vav is another famous stepwell in Ahmedabad built About 500 years ago during the reign of Mehmood Begada, Dada Hari Ni Vav was a step. It is not only designed to store water but also works as a comfortable place for travelers. This is proof that water conservation was also a good idea in history. Since Dada is Hari’s grave behind the wind, its name is Dada Hari Ni Vav."
		},
		"3": {
			"Ans": "Sarkhej Roza",
			"Story": "Sarkhej Roza is also known as Ahmedabad’s Acropolis. Since its design is often compared to the famous Acropolis of Athens, in the beginning, Sarkhej Roja was a major center of Sufi culture and where Sufi saint, Ganj Baksh used to live. It was built by Mohammed Shah in his honor, unlike other mosques, it does not have an arch size gate, but a flat roof with 10 flat domes and 120 columns."
		},
		"4": {
			"Ans": "Bhadra Fort",
			"Story": "One of the historical places in Ahmedabad. When we talk about the monuments in Ahmedabad, the Bhadra Fort is a name that truly deserves a special mention. Located on the eastern bank of the Sabarmati River, it was built by Ahmed Shah of Muzaffarid in 1411. The main attraction of this fort is the Kishore Darwaja or the Maidan Shahi."
		}
	},
	"Haryana": {
		"1": {
			"Ans": "Tomb of Bu-Ali Shah",
			"Story": "It is a fascinating place, almost 700-years-old. It is a tomb of Shaikh Sharafudeen Bu Ali Qalandar Panipati, a saint of Chisti order who lived in India. The son of a great scholar of his time popularly known as Bu-Ali-Shah. It is an epitome of faith, harmony and integrity. Every Thursday, people irrespective of their cast, creed or religion, offer prayers at this place. Urs Mela an annual affair, held here is a manifestation of people’s belief and unity."
		},
		"2": {
			"Ans": "Hanuman Mandir",
			"Story": "Historically, Kaithal was known as Kapisthal, meaning ‘Abode of Kapi’, from Lord Hanumana, the Hanuman Mandir is of prime importance. The temple is situated in the heart of the city at Jattan Moh."
		},
		"3": {
			"Ans": "Tomb Of Sheikh Musa",
			"Story": "The simplistic and utilitarian architecture of the tomb of Sheikh Musa near Nuh shows an ideal blend of Mughal and Rajput styles. Earlier called the Dargah of Hazrat Sheikh Musa, it is located at the base of the Aravalli range off the Taoru Road. A small road from main Sohna by-pass leads to the tomb"
		},
		"4": {
			"Ans": "Star Monument",
			"Story": "This monument is a Samadhi of Tarachandji Maharaj, popularly known as Maharajji by his followers. The beautifully shaped building of Star monument was completed in a very short span of just four years by Param Sant Huzur Kanwar Sahebji Maharaj."
		}
	},
	"Himanchal Pradesh": {
		"1": {
			"Ans": "Masrur Temple",
			"Story": "The Masrur Temples, also referred to as Masroor Temples or Rock-cut Temples at Masrur, is an early 8th-century complex of rock-cut Hindu temples in the Kangra Valley of Beas River in Himachal Pradesh, India. The temples face northeast, towards the Dhauladhar range of the Himalayas."
		},
		"2": {
			"Ans": "Champavati Temple",
			"Story": "This ancient temple was built by Raja Sahil Varman, believed to be the founder of modern Chamba in 920 AD, in the memory of his daughter, Champavati. The ornate carvings that grace its walls. There is a large wheel on the rooftop that makes it different from other temples in the region. The main deity here is Goddess Mahisasuramardini, an avatar of Goddess Durga. The premises also house the shrines of Vasuki Naga and Wazir. Since the temple is so grand, it is often compared to the beautiful Laxmi Narayan Temple in the region. it is managed and maintained by the Archaeological Survey of India (ASI)."
		},
		"3": {
			"Ans": "Rashtrapati Niwas",
			"Story": "The Rashtrapati Niwas (literally the President's Residence), formerly known as Viceregal Lodge, is located on the Observatory Hills of Shimla, Himachal Pradesh, India. It was formerly the residence of the British Viceroy of India. It houses some of the most ancient articles and photographs going back to the times of the British rule in India. The Viceregal Lodge was designed by British architect Henry Irwin and built in the Jacobethan style during Lord Dufferin’s tenure as Viceroy."
		},
		"4": {
			"Ans": "Hadimba Devi Temple",
			"Story": "Hidimba Devi Temple, locally known as Dhungari Temple, also known variously as the Hadimba Temple, is located in Manāli, a hill station in the State of Himāchal Pradesh in north India. It is an ancient cave temple dedicated to Hidimbi Devi, wife of Bhima, a figure in the Indian epic Mahābhārata. The temple is surrounded by a cedar forest called Dhungiri Van Vihar at the foot of the Himālayas. The sanctuary is built over a huge rock jutting out of the ground which was worshiped as an image of the deity. The structure was built in 1553 by Maharaja Bahadur Singh."
		}
	},
	"Jammu Kashmir": {
		"1": {
			"Ans": "Bahu Fort in Jammu",
			"Story": "This fort was built around 3000 years ago by Rajput king Bahu Lochan. It stands tall on the left banks of River Tawi overlooking the Jammu city from its ramparts. The original fort was renovated several times by Dogra kings. It is a primary attraction in Jammu city. The fort is also famous for pilgrimage of Bahu Temple situated within its premises."
		},
		"2": {
			"Ans": "Mubarak Mandi Palace",
			"Story": "This is the most famous palace of Jammu Kashmir. It was built by Dogra dynasty as royal residence of their Maharajas. This palace located in the heart of Jammu city took around 150 years for its completion. It continued to be the imperial seat until 1925 when Maharaja Hari Singh made Hari Niwas Palace, his official residence. Some of the parts in this palace are in ruined state but even then, they add to the magnificence of this monument. This palace is built in European Baroque, Rajasthani, and Mughal styles of architecture. The entire complex encompasses structures that include Darbar Hall, Royal Courts Buildings, Nawa Mahal, Pink Palace, Hawa Mahal, Rani Charak Palace, Sheesh Mahal, and Toshkhana Palace."
		},
		"3": {
			"Ans": "Amar Mahal Palace",
			"Story": "This palace in Jammu is also a stupendous example of kashmiri history. This grand palace was built during 19th century by Maharaja Amar Singh. It is built on the format of a French Chateau. The first floor of this building has enchanted French windows and their triangular projections remind one of the Greek architectural style. The beauty of this palace is enhanced by its location from where it majestically overlooks Jammu city. It has Tawi River flowing towards its side. You can enjoy the views of Shivalik ranges from this palace. The Heritage hotel named as Hari Niwas Palace Hotel is also adjoined to Amar Mahal."
		},
		"4": {
			"Ans": "Bhimgarh Fort in Reasi",
			"Story": "This fort is also known as Reasi Fort. Reasi is a quaint town located towards northwest direction of Jammu city. The fort was used as a place to stay during emergencies by the Dogra rulers. Maharaja Gulab Singh heir to the founder of Reasi town, got this fort rebuilt using stones. It took more than 30 years from 1917 to 1841 to rebuild it. With reconstruction, it was fortified to sustain any attacks."
		}
	},
	"Jharkhand": {
		"1": {
			"Ans": "Maithon Dam",
			"Story": "The monuments of Jharkhand reflect the rich history and the grand architecture of the state. A number of these are preserved as heritage monuments and are recognised throughout the world. These monuments belong to the dynasties that reigned over the province over a long period of time. Hence the visitors would come across Hindu, Buddhist, Muslim and British monuments. The major ancient buildings in Jharkhand are Maithon-Dam, Tilaiya-Dam, Kauleshwari Devi Temple, Bhadrakali Temple and Royal Mosque of Chatra."
		},
		"2": {
			"Ans": "Akbari Mosque",
			"Story": "Monuments in Rajmahal mainly comprises of the famous architectural wonders of the Muslims. The city of Rajmahal is a notified region in the district of Sahibganj in the Jharkhand state. This historical city is located on the western banks of the River Ganges amidst the hills called Daman-i-Khoh at the time of the Muslim rule."
		},
		"3": {
			"Ans": "Palamu Forts",
			"Story": "The Palamu Kila are two ruined forts located around 20 kilometres (12 mi) south east of the city of Daltonganj in the Indian state of Jharkhand. The old fort in the plains, which existed even before the Chero dynasty, was built by the King of Raksel dynasty. These are two large forts located deep in the forests of Palamu on Sher Shah Suri path near Daltonganj. The original fort in the plains and the other on an adjoining hill are attributed to the kings of the Chero dynasty. The fort in the plains had defences on three sides and three main gates. The New fort was constructed by Raja Medini Ray. The architecture is Islamic in style, which reflects Daud Khan’s conquest."
		},
		"4": {
			"Ans": "Maluti Temples",
			"Story": "Maluti temples are a group of 72 extant terracotta temples (out of the original number of 108), located in the Maluti village near Shikaripara in Dumka district on the eastern part of the Chota Nagpur Plateau, Indian state of Jharkhand. These temples, according to the Indian Trust for Rural Heritage and Development (ITRHD), were built between the 17th and 19th centuries. The kings of Baj Basanta dynasty built these temples in Maluti, their capital, inspired by goddess Mowlakshi, their family deity. Many of the temples are deified with different denominations of gods and goddesses, apart from the tutelary deity Mowlakshi, and others such as Shiva, Durga, Kali and Vishnu."
		}
	},
	"Karnataka": {
		"1": {
			"Ans": "Gol Gumbaz",
			"Story": "Gol Gumbaz is the tomb of king Mohammed Adil Shah, Adil Shahi Dynasty. Construction of the tomb, located in Bijapur, Karnataka, India, was started in 1626 and was completed in 1656. The name is based on Gol Gumbadh derived from Gola Gummata meaning circular dome."
		},
		"2": {
			"Ans": "Kittur Fort",
			"Story": "The fort was built by Allappa Gowda Sardesai, the ruler of the Desai dynasty between 1650 and 1681. It was held by the Desai marathas of Kittur, as well as Rani Chennamma, a lingayat woman warrior of Karnataka who revolted against the British in 1824. Kittur reached its zenith during the Mallasarja Desai. The place has a Nathapanthi matha in police line area, and temples of Maruti (in fort), Kalmeshwara, Dyamavva and Basavanna, the last named a later Chalukyan monument now completely renovated."
		},
		"3": {
			"Ans": "Naiknand Palace",
			"Story": "Nalknad Palace or Nalkunadu, called Naalnaad Aramane in the local Kodava language, is a palace located in the Kodagu district of the Indian state of Karnataka. It is located near a village named Yavakapadi and was built between the years 1792 and 1794 AD."
		},
		"4": {
			"Ans": "Sangameshwara temple",
			"Story": "Sangameshwara Temple, which was earlier called Vijayeswara Temple, is a religious site in Pattadakal. It was built by the Chalukya king, Vijayaditya Satyashraya, circa 733 AD. This temple is regarded as one of the oldest temples in India and the oldest temple of this region, thus, making it a must-see site for all tourists. The structure represents Dravidian architectural style and possesses an inner passage, a hall and a sanctum. The outer wall of this temple is adorned with sculptures of Ugranarasimha and Nataraja."
		}
	},
	"Kerala": {
		"1": {
			"Ans": "Methan mani",
			"Story": "Methan Mani is a clock tower which stands next to the Padmanabha Swamy Temple, East Fort, Thiruvananthapuram in the south west Indian state of Kerala. It is a historic landmark and a tourist attraction. The Methan Mani is located near the Padmanabha Swamy Temple in Thiruvananthapuram. To see it, one has to stand before the temple entrance and look in the opposite direction of the Padmatheertha pond."
		},
		"2": {
			"Ans": "Kavi Moyinkutty Vaidyar Smarakam",
			"Story": "The Maha Kavi Moyinkutty Vaidyar Smarakam is a memorial building dedicated to Moyinkutty Vaidyar (1852–1892), often referred to as Mahakavi (great poet), who is historically considered one of the most renowned poets of the Mappila pattu genre of Malayalam language. Moyinkutty Vaidyar was born to Unni Mammad and Kunjamina in year 1852 at Ottupara, Malappuram district, Kerala. His father was famous practitioner of Ayurveda branch of medicines and poet of the times, he completed the work of his son based on Hijra from the 27th Ishal onwards."
		},
		"3": {
			"Ans": "Vivekananda Rock Memorial",
			"Story": "Vivekananda Rock Memorial is a monument in Kanyakumari, India. It was built in 1970 in honour of Swami Vivekananda, who is said to have attained enlightenment on the rock. According to legends, it was on this rock that Goddess Kanyakumari (Parvathi) performed tapas in devotion of lord Shiva. A meditation hall known as Dhyana Mandapam is also attached to the memorial for visitors to meditate. The design of the mandapa incorporates different styles of temple architecture from all over India. The rocks are surrounded by the Laccadive Sea. The memorial consists of two main structures, the Vivekananda Mandapam and the Shripada Mandapam."
		},
		"4": {
			"Ans": "Vetti Muricha Kotta",
			"Story": "On the eastern side of the historic fort in Thiruvananthapuram can be seen three important gateways — the Kizhakkae kotta (East Fort gate) leading to the eastern gopuram of Padmanabha Swamy temple, the Pazhavangadi kotta (one adjacent to Pazhavangadi Ganapathy temple), and the Vettimuricha kotta, on the south-eastern section. Elderly folks recall many interesting stories associated with these fort gates. The Thiruvananthapuram Fort is built around Sree Padmanabha Swami Temple which was the centre of many historical events. Even though the work was started in 1747, during the reign of Marthandavarma Maharaja, the Fort was completed by Karthika Thirunal Dharma Raja in 1787 A.D."
		}
	},
	"Madhya Pradesh": {
		"1": {
			"Ans": "Elephant palace",
			"Story": "The Elephant Palace belongs to the Malwa's which are quite famous for their brilliant buildings and palace structures. Up to a sprawling 100 km, you shall find a couple of primitive buildings which is known as the Rock City. This gigantic structure is a prominent tourist destination which resembles a huge elephant."
		},
		"2": {
			"Ans": "Ashrafi Mahal",
			"Story": "According to one of the famous folklores, taking a concern towards increasing obesity amount his queens, Ghiyasuddin Khilji came up with a superb idea. He thought of encouraging the queens to reduce their weight by asking them to climb the staircase of the Mahal up and down regularly. In return, he also decided to give them an Ashrafi (gold coins) to the queens. The number of Ashrafi was based on the number of steps climbed by each queen every day. Hence this resulted in the name ‘Ashrafi Mahal'."
		},
		"3": {
			"Ans": "Sanchi Stupa No.2",
			"Story": "The Stupa No. 2 at Sanchi, also called Sanchi II, is one of the oldest existing Buddhist stupas in India, and part of the Buddhist complex of Sanchi in Madhya Pradesh. It is of particular interest since it has the earliest known important displays of decorative reliefs in India, probably anterior to the reliefs at the Mahabodhi Temple in Bodh Gaya, or the reliefs of Bharhut. It displays what has been called the oldest extensive stupa decoration in existence. Stupa II at Sanchi is therefore considered as the birthplace of Jataka illustrations."
		},
		"4": {
			"Ans": "Bhojpur Temple",
			"Story": "Bhojpur takes its name from king Bhoja (reg. c. 1000–1055 CE), the most celebrated ruler of the Paramāra dynasty. There is no archaeological evidence from Bhojpur before the eleventh century, a fact confirmed by local legends which recount how Bhoja made a vow to build a series of dams to arrest the streams of nine rivers and ninety-nine rivulets. A location was found in the kingdom that allowed the king to fulfil this vow and the dams were duly built at Bhojpur."
		}
	},
	"Maharashtra": {
		"1": {
			"Ans": "Pratapgad Fort",
			"Story": "Pratapgad Fort is a mountain fort built by Chhatrapati Shivaji Maharaj. The fort holds a sturdy view of coastal Konkan. The famous minister Morepant Pingale on the command of Shivaji Maharaj to control the rebellious satraps of the surrounding Javali Basin built Pratapgad Fort in 1656. The historic battle between Chhatrapati Shivaji and Afzal Khan, the commander of the Bijapur Sultanate took place at Pratapgad."
		},
		"2": {
			"Ans": "Trimbakeshwar Shiva Temple",
			"Story": "Trimbakeshwar Shiva Jyotirlinga Temple is an ancient Hindu temple in the town of Trimbak, in the Trimbakeshwar tehsil in the Nashik District of Maharashtra, India, 28 km from the city of Nashik and 40 km from Nashik road. It is dedicated to the god Shiva and is one of the twelve jyotirlingas."
		},
		"3": {
			"Ans": "Elephanta Caves",
			"Story": "Designated by UNESCO as a World Heritage Site, the Elephanta Caves are a collection of cave temples. They are on Elephanta Island, or Gharapuri (literally the city of caves), in Mumbai Harbour, 10 kilometres (6.2 mi) east of Mumbai in the Indian state of Mahārāshtra. The Elephanta Caves contain rock cut stone sculptures, mostly in high relief. It is currently maintained by the Archaeological Survey of India (ASI)."
		},
		"4": {
			"Ans": "Gateway of India",
			"Story": "The Gateway of India is an arch-monument built in the early 20th century in the city of Mumbai, India. The gateway is also the monument from where the last British troops left India in 1948, following Indian independence. It is located on the waterfront at an angle, opposite the Taj Mahal Palace and Tower Hotel and overlooks the Arabian Sea. Today, the monument is synonymous with the city of Mumbai, and is amongst its prime tourist attractions"
		}
	},
	"Manipur": {
		"1": {
			"Ans": "Kangla Fort",
			"Story": "Depicting the royalty of the former rulers of Manipur since 33 AD, the Kangla fort is an epitome of impressive heritage located in the capital city of Manipur, Imphal. Occupied by the British in 1891, this old palace withstood several attacks and invasions and is one of the most attractive tourist spots in Manipur."
		},
		"2": {
			"Ans": "Sri Radha Krishnacandra Temple",
			"Story": "ISKCON Imphal – Sri Sri Radha Krishna Chandra Temple, is situated close to the banks of the Imphal River. Featuring a unique architecture, the structure of this temple is made using bricks that are coated with white cement. This gives the impression that the shrine is built of white marbles."
		},
		"3": {
			"Ans": "Sanamahi Temple",
			"Story": "This beautiful white Manipuri temple, reconstructed in Gothic style for roof lies in the lap of nature in Jiriban which is approximately 12.5 kms away from the capital city, Imphal. The surrounding of the temple is peaceful forest area with a mesmerising and enchanted view. This Sanamahi temple is considered to be one of the oldest temples of Asia."
		},
		"4": {
			"Ans": "Rasmancha",
			"Story": "Rasmancha is a less explored tourist attraction in Manipur. Located in the district of Bishnupur, it was a temple earlier where Ras Festival was celebrated. It was also used to stage dances. Rasmancha is believed to be the oldest pyramidal superstructure shaped brick temple. At present, this temple has become one of the top heritage sites in Manipur and is protected under the Archaeological Survey of India (ASI)."
		}
	},
	"Meghalaya": {
		"1": {
			"Ans": "Nartiang Monoliths",
			"Story": "It was erected by U Marphalyngki, a trusted lieutenant of the Jaintia kings. The followers of the erstwhile Jaintia Kings U Marphalyngki and U Luh Lyngshkor Lamare erected the other monoliths in the early 17th century. Monoliths exist throughout the length and breadth of the Khasi and Jaintia Hills."
		},
		"2": {
			"Ans": "Kiang Nongbah Monument",
			"Story": "A true patriot who rose in rebellion against the British, fought them bravely till his eventual capture dies a martyr for the cause of India’s liberation. Jaintia king U Kiang Nangbah was hanged publicly on 30th December 1862. A memorial to commemorate his valor was erected on the banks of Myntdu River."
		},
		"3": {
			"Ans": "Mawsmai Cave",
			"Story": "At a distance of 4 km from Cherrapunji Bus Stand, Mawsmai Cave is a beautiful limestone cave located at Cherrapunji in the North East Indian state of Meghalaya. It is one of the most popular historical Caves in Meghalaya and among the best places to experience Cherrapunji Tourism."
		},
		"4": {
			"Ans": "Double Decker Living Root Bridge",
			"Story": "The Double Decker Living Root Bridge, in the heart of the rainiest place in India, Cherapunjee, Meghalaya is known worldwide as one of the most unique naturally formed structures, that stands strongly since its inception and is frequented by travelers from around the world."
		}
	},
	"Mizoram": {
		"1": {
			"Ans": "Khuangchera Puk",
			"Story": "Located in Ailawng near Reiek, about 30 km from Aizawl in the west, this is a cave named after Khuangchera, the legendary Mizo warrior who lived here in the late 19th century. This is the second-longest cave in Mizoram with a length of 162 metre. The vertical range of the cave is 10 metre deep."
		},
		"2": {
			"Ans": "Fiara Tui",
			"Story": "The legendary Fiara tui is situated 65 kms from Champhai. The source of this water is á¹¬an tlang (mountain). The story goes that due to shortage of drinking water, long distances have to be travelled for collection of water. Fiara, the only son of a poor widow, happen to turn a flat stone and to his great delight and astonishment found a crystal clear source of water. This was kept a secret by the widow and her son. In time it was found by the villages that this water was found better and sweeter then other water source."
		},
		"3": {
			"Ans": "Pukzing Cave",
			"Story": "Literally A Cave of Shouting Stone, Pukzing is located near Pukzing village which is kms to the North - West of Aizawl. A spacious cave, it has three chambers of about 4 sq.metre each connected with narrow passages. A legend goes that in the olden days the villagers used to hear evil spirits shouting inside the cave. It is also said that somewhere inside this cave, the legendary character Maurawkela hid the Magical Drum he took away from a troop of monkeys after seeing them conjure fruits by beating it."
		},
		"4": {
			"Ans": "Vantawang Falls",
			"Story": "A lively waterfall in Serchhip district of Mizoram, Vantawang Falls is around 137km from Aizawl and attracts travellers for its scenic surroundings. Vantawang Falls is claimed to be the highest and most spectacular waterfalls in the state. The fall is located in Vanva River near Thenzawl and is surrounded by lush greenery and rocky terrain."
		}
	},
	"Nagaland": {
		"1": {
			"Ans": "The Dimasa Kachari Ruins",
			"Story": "Kachari Ruins or The Dimasa Kachari Ruins are a set of remnants (generally 8 to 10 feet high) which is located in the town of Dimapur in Nagaland. The ruins are a series of mushroom domed pillars that were created by the Dimasa Kachari Kingdoms that ruled before Ahom invasion during the 13th century."
		},
		"2": {
			"Ans": "Mokokchung",
			"Story": "Reckoned to be the most beautiful and a lively district in Nagaland, Mokokchung is the home of the Ao tribe. Known for its hospitality, rich traditions and festivals, Mokokchung is gradually becoming a hotspot for tourism in Nagaland. It is often said that one of its destinations named Longkhum is a paradise for nature enthusiasts."
		},
		"3": {
			"Ans": "Tuophema Village",
			"Story": "A tourist village, situated about 41kms away from Kohima, Tuophema is built around ethnic model of tourism. The village offers traditionally styled thatched huts, traditional artefacts, jewelleries, clothing and souvenir museum and authentic Naga delicacies. This   place gives an opportunity to soak the colour of Nagas and learn more about the culture of this fascinating land."
		},
		"4": {
			"Ans": "Kohima War Cemetery",
			"Story": "Kohima War Cemetery is a memorial dedicated to soldiers of the 2nd British Division of the Allied Forces who died in the Second World War at Kohima, the capital of Nagaland, India, in April 1944. The soldiers died on the battleground of Garrison Hill in the tennis court area of the Deputy Commissioner's residence."
		}
	},
	"Odisha": {
		"1": {
			"Ans": "Sun Temple",
			"Story": "Konark Sun Temple is a 13th-century CE (year 1250) Sun temple at Konark about 35 kilometres northeast from Puri on the coastline of Odisha, India. The temple is attributed to king Narasimhadeva I of the Eastern Ganga Dynasty about 1250 CE. Declared a UNESCO world heritage site in 1984, it remains a major pilgrimage site for Hindus, who gather here every year for the Chandrabhaga Mela around the month of February."
		},
		"2": {
			"Ans": "Sri Jagannath Puri Temple",
			"Story": "Located in the sacred town of Puri, the Jagannath Temple or the pride of India was built in the 11th century by King Indradyumna. This glorious temple is the abode of Lord Jagannath who is a form of Lord Vishnu. It is the most revered pilgrimage site for Hindus and is included in the pious Char Dham Yatra with Badrinath, Dwarka and Rameshwaram. Apart from the main shrine that rises high, many minor temples within the complex will make you feel like you have entered God's home itself."
		},
		"3": {
			"Ans": "Dhauli Shanti Stupa",
			"Story": "Dhauli is a small town 8 Km away south of Bhubaneswar, located on the bank of river Daya and holds great significance for the followers of lord Buddha. Dhauli is said to be the witness of the reform of Ashoka's character."
		},
		"4": {
			"Ans": "Khandagiri Caves",
			"Story": "Also known as Cuttack caves, Khandagiri Caves are artificial caves which date back to the 2nd century. This historical place in Odisha is quite a sight to see with all the beautifully carved inscriptions and figures. A large number of ancient temples with intricate carvings and a vast historical significance. If you want to relax and spend some quiet time amidst nature, a number of lush green parks are also located around Khandagiri Caves."
		}
	},
	"Punjab": {
		"1": {
			"Ans": "Sri Harmandir Sahib",
			"Story": "Whenever anybody talks about Punjab, the first thing that comes to the mind is the Golden temple in Amritsar. It is not just a temple or a tourist spot, but the biggest cultural heritage of the Sikh community. It is one of the biggest assets of the Indian subcontinent. The work started in 1577 AD, by digging a pious lake, the Amrit Sarovar. The idea was conceived by Sri Guru Amar dass Ji and was executed by Sri Guru Ram Dass Ji. The construction of Sri Harmandir Sahib was initiated by Sri Guru Arjan Dev Ji in 1588 AD."
		},
		"2": {
			"Ans": "Jallianwala Bagh",
			"Story": "April 13, 1919 is marked as a black day during the history of the British period in India. Thousands of innocent and non-violent protesters were brutally murdered by a British troop, led by general Reginald Dyer, who sniffed conspiracy against the British rule as the non-violent protest was organized by Mahatma Gandhi against the implement of the Rowlatt Act. The gory incident took place in the Jallianwala Bagh ground, where the British troop opened fire without any notice."
		},
		"3": {
			"Ans": "Sheesh Mahal",
			"Story": "Sheesh Mahal, or the ‘Palace of Mirrors’ in Patiala is a visual grandeur in true sense. It was originally home to the Kings of Patiala. The design of the palace was conceived by Maharaja Narinder Singh. A portion of the palace is made of colored glasses, which gives a vibrant touch to the beauty of the palace. The walls and ceilings were painted by Rajasthani artists, portraying the stories of the old ages. Beautiful garden, fountains, an artificial lake and a bridge called the Lakshman Jhoola, heightens the beauty of the premises to a heavenly extent."
		},
		"4": {
			"Ans": "Banda Singh Bahadur War Memorial",
			"Story": "Baba Banda Singh Bahadur War Memorial at Chappar Chiri, Mohali is a befitting tribute to the brave Sikh warrior under whose command the Battle of Chappar Chiri was fought between the Sikhs and the forces of Mughal Empire led by Wazir Khan in May 1710. With a decisive victory in this war, a Sikh rule was established from Lahore to Delhi. The memorial is situated on a plot of about 20 acres, now falling in Sector 93, Sahibzada Ajit Singh Nagar (Mohali) in Punjab."
		}
	},
	"Rajasthan": {
		"1": {
			"Ans": "Chand Baori",
			"Story": "About 100km from Jaipur, the remote village of Abhaneri, surrounded by wheat fields, is the unlikely location for one of the most awe-inspiring monuments in Rajasthan. An incredible geometric sight, the Chand Baori step-well has around 11 visible levels of zigzagging steps and is 20m deep. The well, the crumbling palace and the Harshat Mata Temple are believed to have been built by King Chand, ruler of Abhaneri and a Rajput from the Chahamana dynasty. Interestingly, it featured in The Dark Knight Rises (2012) as Batman’s prison."
		},
		"2": {
			"Ans": "City Palace",
			"Story": "Udaipur’s sprawling City Palace – the largest in Rajasthan – stands on a ridge overlooking the lake. Begun by Udai Singh and extended by subsequent maharanas, the sand-colour City Palace rises five storeys tall, with a series of balconies. Cupolas crown its octagonal towers, which are connected by a maze of narrow passageways. The rooms inside the City Palace Museum contain decorative art: beautiful paintings, colourful enamel, inlay glass-work and antique furniture."
		},
		"3": {
			"Ans": "Lake Palace",
			"Story": "This 250-year-old white marble palace –floats like a mirage in the middle of Lake Pichola and looks dazzling from the shore. Reached by a short boat ride, it was initially built as a summer retreat by Maharana Jagjit Singh who ruled Jaipur in the 17th century. Today, the palace is only accessible to guests of the hotel, but anyone can enjoy a lovely view of its exterior by taking a boat ride around Lake Pichola. Alternatively, to end your time in Rajasthan on an exceptional note, stay here for a night or two – it’s one of the world’s most famous luxury hotels, a fairy-tale-like experience with an undeniable sense of location."
		},
		"4": {
			"Ans": "Hawa Mahal",
			"Story": "Jaipur’s famed Hawa Mahal (Palace of Winds) was built in 1799 so that the women of the court could discreetly take some air and watch the activity on the street below. One of the most unique monuments in Rajasthan, this five-storey structure is just one room wide, so the wind quickly passes through the building and cools the interior. The building façade has a delicate honeycomb design with close to 1,000 windows."
		}
	},
	"Sikkim": {
		"1": {
			"Ans": "Rabdentse Ruins",
			"Story": "Rabdentse Ruins is one of the major historical monuments of Sikkim, located in the city of Pelling in West Sikkim. Rabdentse was the second capital of the former Kingdom of Sikkim from 1670 to 1814.  It was destroyed after the Nepalese invasion in the 18th century. The spot has stunning perspectives inundated with history all around. The Rabdentse Ruins are a part of the Buddhist pilgrimage circuit which consists of many monasteries starting from the Yuksom, which is the Dubdi Monastery. The palace is preserved by the Archaeological Survey of India and is also considered to be a historical monument of Sikkim."
		},
		"2": {
			"Ans": "Rumtek Monastery",
			"Story": "Rumtek Monastery also called the Dharma Chakra Centre, is a gompa located in Gangtok, capital of Sikkim. it is one of the most significant and largest monasteries in Sikkim, Rumtek Monastery is the most visited place in Sikkim among many other famous historical places of Sikkim. The monastery was founded by Wangchuk Dorje, 9th Karmapa Lama in the 16th century, Rumtek Monastery is the seat of the Karmapa Lama, It was the main seat of the Karma Kagyu lineage for a while. In 1959 after fleeing Tibet, Rangjung Rigpe Dorje arrived in Sikkim and discovered that this place was in ruins."
		},
		"3": {
			"Ans": "Namchi",
			"Story": "Namchi is settled at an elevation of more than 4000 ft and is located in the South Sikkim district at a distance of about 80 km from Gangtok. It is generally popular for housing the world's largest statue of Padmasambhava, a Buddhist guru of the 8th century."
		},
		"4": {
			"Ans": "Pemayangtse Monastery",
			"Story": "Pemayangtse Monastery is said to be one of the oldest monasteries in Northeast India and is located in the close proximity of Pelling at a distance of about 110 km from Gangtok. It is a site of great historical as well as religious importance. As per records, it was originally built in the 17th century; however, the current building is said to have been constructed in the early 18th century."
		}
	},
	"Tamil Nadu": {
		"1": {
			"Ans": "Meenakshi Amman Temple",
			"Story": "The Meenakshi temple complex is one of the largest in India. The presiding deity at the Meenakshi temple at Madurai, the Athens of South India, is Goddess Meenakshi. The nucleus of the temple is older than the Madurai city. The splendor of the Meenakshi temple has remained intact for the past so many centuries. The Meenakshi temple complex at Madurai is not only an architectural marvel but also the epitome of Indian culture and civilization."
		},
		"2": {
			"Ans": "Valluvar Kottam",
			"Story": "The construction of the Valluvar Kottam was conceived and executed by the then Chief Minister of Tamil Nadu M. Karunanidhi during the 1970s. The monument consists of a decorative arch, an auditorium that can accommodate around 3,500 people, and the Kural Manimandapam, where all the 1,330 couplets from all 133 chapters of the Kural literature are inscribed on bas-relief.  It was designed by South Indian traditional architect V. Ganapati Sthapati."
		},
		"3": {
			"Ans": "Thirumalai Nayak Palace",
			"Story": "Thirumalai Nayak Palace is a 17th-century palace erected in 1636 AD by King Tirumala Nayaka, a king of Madurai's Nayaka dynasty who ruled Madurai from 1623 to 1659, in the city of Madurai, India. This Palace is a classic fusion of Italian and Rajput styles. The building, which can be seen today, was the main Palace, in which the king lived. After independence, the Thirumalai Palace was declared as a national monument and is now under the protection of the Tamil Nadu Archaeological Department."
		},
		"4": {
			"Ans": "Madras High Court",
			"Story": "The High Court of Judicature at Madras, one of the three High Courts in India established at the Presidency Towns by Letters Patent granted by Her Majesty Queen Victoria, bearing date 26th June 1862 is the highest Court in the State of Tamil Nadu, exercising Original Jurisdiction over the City of Madras and Appellate Jurisdiction over the entire State as well as extra-ordinary Original Jurisdiction, Civil and Criminal, under the Letters Patent and Special Original Jurisdiction for the issue of writs under the Constitution of India."
		}
	},
	"Telangana": {
		"1": {
			"Ans": "Gulzar Houz",
			"Story": "Gulzar Houz is a historical fountain located in Hyderabad, India. It is located near Charminar. The fountain is in the middle of the road between Charminar and Madina building. The area between the four arches of Charkaman was a vast square called Jilu Khana or the Guard's Square. In the centre of the square was the Char-Su-Ka-Hauz (the cistern of four cardinal points). This was later known as Suka-Hauz and now Gulzar Houz. This was built 350 feet equidistant from the four kamaans surrounding it. Initially it was 12 sided then it turned octagonal and today it looks almost circular. It was an octagonal shaped water reservoir made for quenching the thirst of the Nizam's soldiers. At that time, there were four streams flowing from this fountain, dividing each of the Radial roads into two halves. It was constructed by Mir Momin Astarabadi, the first prime minister under Mohammed Quli Qutub Shah around 400 years ago."
		},
		"2": {
			"Ans": "Qutb Shahi tombs",
			"Story": "The Qutub Shahi Tombs are located in the Ibrahim Bagh (garden precinct), close to the famous Golconda Fort in Hyderabad, India. They contain the tombs and mosques built by the various kings of the Qutub Shahi dynasty. The galleries of the smaller tombs are of a single storey while the larger ones are two storied. In the centre of each tomb is a sarcophagus which overlies the actual burial vault in a crypt below. The domes were originally overlaid with blue and green tiles, of which only a few pieces now remain. "
		},
		"3": {
			"Ans": "Chowmahalla Palace",
			"Story": "The palace is unique for its style and elegance. Construction of the palace began in the late 18th century and over the decades a synthesis of many architectural styles and influences emerged. The palace consists of two courtyards as well as the grand Khilwat (the Dharbar Hall), fountains and gardens. The palace originally covered 45 acres (180,000 m2), but only 12 acres (49,000 m2) remain today."
		},
		"4": {
			"Ans": "Char minar",
			"Story": "The Charminar ('four minarets') constructed in 1591, is a monument and mosque located in Hyderabad, Telangana, India. The landmark has become known globally as a symbol of Hyderabad and is listed among the most recognised structures in India. It has also been officially incorporated as the Emblem of Telangana for the state of Telangana.The Charminar's long history includes the existence of a mosque on its top floor for more than 400 years. While both historically and religiously significant, it is also known for its popular and busy local markets surrounding the structure, and has become one of the most frequented tourist attractions in Hyderabad. Charminar is also a site of numerous festival celebrations, such as Eid-ul-adha and Eid al-Fitr."
		}
	},
	"Tripura": {
		"1": {
			"Ans": "Ujjayanta Palace",
			"Story": "The Ujjayanta Palace (Nuyungma in Tripuri language) is a museum and the former palace of the Kingdom of Tripura situated in Agartala, which is now the capital of the Indian state of Tripura. The palace was constructed between 1899 and 1901 by Maharaja Radha Kishore Manikya Debbarma and stands on the banks of two lakes surrounded by gardens inspired by the European style. It was the home of the ruling Manikya dynasty until Tripura's merger into India in October 1949"
		},
		"2": {
			"Ans": "Neermahal",
			"Story": "Neermahal (Twijilikma Nuyung) (meaning Water Palace) is a former royal palace built by Maharaja of Tripura Kingdom Bir Bikram Kishore Manikya bahadur of the erstwhile Kingdom of Tripura, India in the middle of the lake Twijilikma (Now known as Rudrasagar) in 1930 and was completed by 1938. It is situated in Melaghar, 53 kilometers away from Agartala, the capital of Tripura. The palace is situated in the middle of Rudrasagar Lake and assimilates Hindu architectural style"
		},
		"3": {
			"Ans": "Bhubaneswari Temple",
			"Story": "Bhubaneswari Temple is a Hindu temple located in Tripura, India, in Rajnagar (55 km from Agartala). Believed to be built in 1660–1675 AD, it is located next to the palace built by Maharaja Govinda Manikya. The temple is mentioned in Rabindranath Tagore’s work."
		},
		"4": {
			"Ans": "Pushpabanta Palace",
			"Story": "Raj Bhavan (translation: Government House) is the official residence of the Governor of Tripura. It is located in the capital city of Agartala, Tripura. A new Raj Bhavan was built and inaugurated in April 2018. The previous Raj Bhavan was built in 1917, it was known as the Pushpabanta Palace in the pre-independence days. It will become a museum and research centre on Maharaja Birendra Kishore Manikya Debbarman Bahadur. The present governor of Tripura is Ramesh Bais."
		}
	},
	"Uttar Pradesh": {
		"1": {
			"Ans": "Saranath Stupa",
			"Story": "Dhamek Stupa is a massive stupa located at Sarnath, 13 km away from Varanasi in the state of Uttar Pradesh, India. The Dhamek Stupa is said to mark the spot (Rishipattana which can be translated as where the Rishi arrived) where the Buddha gave the first sermon to his first five disciples, led by Kaundinya, after attaining enlightenment, revealing his Eightfold Path leading to nirvana."
		},
		"2": {
			"Ans": "Ramnagar Fort",
			"Story": "Ramnagar Fort in Ramnagar is located near the Ganga River in Varanasi and known for Saraswati Bhawan museum. The fort palace is an important location for outdoor shooting of Indian movies. The sandstone structure was built in the Mughal style in 1750 by Kashi Naresh Maharaja Balwant Singh. At present, the fort is not in a good shape. The current king and the resident of the fort is Anant Narayan Singh, who is also known as the Maharaja of Benares even though this royal title has been abolished since 1971."
		},
		"3": {
			"Ans": "Deogarh monuments",
			"Story": "Deogarh village is located on the right bank of Betwa River and known for many ancient monuments from Gupta Empire. The Deogarh monuments are protected by the Archaeological Survey of India, such as Shantinath Temple,Dashavatara temple Deogarh fort and Varaha temple."
		},
		"4": {
			"Ans": "Taj Mahal",
			"Story": "The Taj Mahal is a world heritage site and best example of Mughal architecture in India. Taj Mahal attracts a large number of tourists and most visited historical monuments in Uttar Pradesh, located on the south bank of the Yamuna river."
		}
	},
	"Uttarakhand": {
		"1": {
			"Ans": "Badrinath Temple",
			"Story": "The famed town of Badrinath is among the four Char Dham pilgrimage sites of India as well as the Chota Char Dham. It is perched at an average elevation of 3,300 metres (10827 feet) above sea level on the banks of Alaknanda River. This holy town is named after the Badrinath temple dedicated to the preserver, Lord Vishnu."
		},
		"2": {
			"Ans": "Baijnath",
			"Story": "Baijnath is famous for its ancient temples, located at an altitude of 1126 mts, on the banks of the Gomti River in the Bageshwar district of Uttarakhand. The town draws its name from the Baijnath temple. It is one of the important places to visit in Bageshwar (Kumaon region) because of its historical and religious importance."
		},
		"3": {
			"Ans": "Kalinga Monuments",
			"Story": "Set up by the Britons to commemorate the bravery of Gorkha army, Khalinga War Memorial is the world's first memorial erected by an army for their opponents. This one of its kind memorials, set up on the Sahastradhara Road, was made in the honor of Gorkha Regiment after the 1814-16 war. As per the historical facts, Gorkhas defended the Kangra army from the British army for six weeks without food and water supply."
		},
		"4": {
			"Ans": "Rudranath Temple",
			"Story": "Rudranath Temple is a temple of Lord Shiva situated in Chamoli district of Uttarakhand state of India,which is one of the Panchkedars .Located at an altitude of 2290 meters above sea level, the Rudranath temple is full of grand natural shade. In the Rudranath temple, Lord Shankar’s Ekanan means that the face is worshiped, while the whole body is worshiped in the Pashupatinath of Nepal’s capital of Kathmandu. The Nanda Devi and the snow-covered peaks of Trishul are visible from the front of the Rudranath temple."
		}
	},
	"West Bengal": {
		"1": {
			"Ans": "Belur Math",
			"Story": "Founded by Swami Vivekananda, Belur Math is one of the best historical sites in West Bengal. This site is Ramkrishna Math and Mission’s headquarters and was created to integrate all the religions prevalent in India, including Hinduism, Islamism, Christianity, Buddhism, and others. There are motifs of the said religions that are carved on the outer surface of the temple."
		},
		"2": {
			"Ans": "Jor Bangla Temple",
			"Story": "Commonly known as “Yorubangala,” Jor Bangla Temple is a great historical site located in West Bengal. This site is situated in Bishnupur and has a unique architecture. With two different structures that resemble the design of common huts of Bengal, this temple is quite beautiful. Commissioned by the then ruler of Bishnupur, Raghunatha Singha II, this monument was constructed in 1655."
		},
		"3": {
			"Ans": "Victoria Memorial",
			"Story": "One of the most notable sites of Kolkata, Victoria Memorial is a must-see monument in Kolkata. Constructed in the year 1921, this building was dedicated to Queen Victoria of England. It was commissioned by the then Viceroy of India, Lord Curzon. The architecture of Victoria Memorial was handled by architect William Emerson, the member of the Royal Institute of British Architects."
		},
		"4": {
			"Ans": "Cooch Behar Palace",
			"Story": "Cooch Behar Palace in West Bengal is immensely beautiful. Commissioned by Maharaja Nripendra Narayan of the Koch dynasty, this palace was originally known as Victor Jubilee palace. The grandeur of the palace will genuinely mesmerize you no matter how many times you see it. With a height of 395 feet and a width of 296 feet, this palace is visibly majestic and aesthetically pleasing. The influence of Renaissance architecture in this palace is quite notable."
		}
	}
}